//
//  DZ 24 Skut Drawings.h
//  DZ 24 Skutar Drawings
//
//  Created by mac on 01.04.17.
//  Copyright © 2017 Dima Zgera. All rights reserved.
//

#import <Foundation/Foundation.h>

@interface DZ_24_Skut_Drawings : NSObject

@end


//-----DZ 24 --- Drawings

Вот такой вот базовый урок получился. Эта тема - поле непаханое. Вы можете, если захотите, поискать кучу гайдов и примеров по этому материалу. Можно делать классные вещи. Но я не хочу на этом на долго останавливаться, нам нужно идти дальше :)

Ученик.

1. Нарисуйте пятиконечную звезду :)
2. Добавьте окружности на концах звезды
3. Соедините окружности линиями

Студент.

4. Закрасте звезду любым цветом цветом оО
5. При каждой перерисовке рисуйте пять таких звезд (только мелких) в рандомных точках экрана

Мастер

6. После того как вы попрактиковались со звездами нарисуйте что-то свое, проявите творчество :)

Супермен

7. Сделайте простую рисовалку - веду пальцем по экрану и рисую :)